       IDENTIFICATION DIVISION.
       PROGRAM-ID. BOTTEST.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 INPUT-DATA.
         COPY DATA.
       PROCEDURE DIVISION.
           CALL 'SIMPLBOT' USING INPUT-DATA
           .
       9999-END
           .
