           TESTSUITE 'UNIT TESTS FOR SIMPLBOT.CBL'

           TESTCASE 'MAEXCHEN(2,1) IS HIGHER THAN 3,1'
           MOVE 3 TO DICE-1 IN ANNOUNCED-DICE
           MOVE 1 TO DICE-2 IN ANNOUNCED-DICE
           MOVE 2 TO DICE-1 IN ROLLED-DICE
           MOVE 1 TO DICE-2 IN ROLLED-DICE
           PERFORM COMPARE-ROLLED-DICE-TO-ANNOUNCED-DICE
           EXPECT MY-DICE-IS-HIGHER TO BE TRUE
           EXPECT MAEXCHEN-ROLLED TO BE TRUE

           TESTCASE 'PASCH(2,2) IS LOWER THAN 3,3 (PASCH)'
           MOVE 3 TO DICE-1 IN ANNOUNCED-DICE
           MOVE 3 TO DICE-2 IN ANNOUNCED-DICE
           MOVE 2 TO DICE-1 IN ROLLED-DICE
           MOVE 2 TO DICE-2 IN ROLLED-DICE
           PERFORM COMPARE-ROLLED-DICE-TO-ANNOUNCED-DICE
           EXPECT MY-DICE-IS-LOWER TO BE TRUE
           EXPECT PASCH-ROLLED TO BE TRUE

           TESTCASE '(5,4) IS LOWER THAN 3,3 (PASCH)'
           MOVE 3 TO DICE-1 IN ANNOUNCED-DICE
           MOVE 3 TO DICE-2 IN ANNOUNCED-DICE
           MOVE 5 TO DICE-1 IN ROLLED-DICE
           MOVE 4 TO DICE-2 IN ROLLED-DICE
           PERFORM COMPARE-ROLLED-DICE-TO-ANNOUNCED-DICE
           EXPECT MY-DICE-IS-LOWER TO BE TRUE

           TESTCASE '(5,4) IS HIGHER THAN 4,3'
           MOVE 4 TO DICE-1 IN ANNOUNCED-DICE
           MOVE 3 TO DICE-2 IN ANNOUNCED-DICE
           MOVE 5 TO DICE-1 IN ROLLED-DICE
           MOVE 4 TO DICE-2 IN ROLLED-DICE
           PERFORM COMPARE-ROLLED-DICE-TO-ANNOUNCED-DICE
           EXPECT MY-DICE-IS-HIGHER TO BE TRUE

           TESTCASE 'ROUND-STARTING COMMAND IS PARSED CORRECTLY'
           MOVE "ROUND STARTING;8f8d645e-efeb-4249-bdcd-99b1ace47f93"
             TO SERVER-MESSAGE
           PERFORM PARSE-SERVER-MESSAGE
           EXPECT TOKEN TO BE "8f8d645e-efeb-4249-bdcd-99b1ace47f93"
           EXPECT ROUND-STARTING TO BE TRUE

           TESTCASE 'ROLLED COMMAND IS PARSED CORRECTLY'
           MOVE "ROLLED;6,1;ea432623-5dfc-42bb-8dcb-495f850623ae"
             TO SERVER-MESSAGE
           PERFORM PARSE-SERVER-MESSAGE-ROLLED
           EXPECT TOKEN TO BE "ea432623-5dfc-42bb-8dcb-495f850623ae"
           EXPECT ROLLED-DICE TO BE "6,1"
           EXPECT ROLLED TO BE TRUE

           TESTCASE 'ANNOUNCED COMMAND IS PARSED CORRECTLY'
           MOVE "ANNOUNCED;Frank1;3,1"
             TO SERVER-MESSAGE
           PERFORM HANDLE-ANNOUNCED
           EXPECT ANNOUNCED-DICE TO BE "3,1"
           EXPECT ANNOUNCED TO BE TRUE
